In [2]:
import pandas as pd

In [3]:
#no of rows only load specefic rows
df = pd.read_csv('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/data.csv',nrows=6)
df

,Url Car,Name,Price,Brand,Condition,Img,Img Url
0,https://ikman.lk/en/ad/audi-a4-20tdi-2014-for-...,Audi A4 2.0TDi 2014,72500,Audi,Used,Img/0.png,https://i.ikman-st.com/audi-a4-20tdi-2014-for-...
1,https://ikman.lk/en/ad/mercedes-benz-e300-nigh...,Mercedes Benz E300 Night Edition 2015,107500,Mercedes Benz,Used,Img/0.png,https://i.ikman-st.com/mercedes-benz-e300-nigh...
2,https://ikman.lk/en/ad/mercedes-benz-c200-head...,Mercedes Benz C200 headup display 2015,109000,Mercedes Benz,Used,Img/0.png,https://i.ikman-st.com/mercedes-benz-c200-head...
3,https://ikman.lk/en/ad/toyota-axio-x-grade-200...,Toyota Axio X Grade 2007,31125,Toyota,Used,Img/0.png,https://i.ikman-st.com/toyota-axio-x-grade-200...
4,https://ikman.lk/en/ad/micro-panda-12000kms-20...,Micro Panda 12000KMs 2015,12475,Micro,Used,Img/0.png,https://i.ikman-st.com/micro-panda-12000kms-20...
5,https://ikman.lk/en/ad/nissan-sunny-fb15-super...,Nissan Sunny FB15 SUPER SLOON 2001,20250,Nissan,Used,Img/0.png,https://i.ikman-st.com/nissan-sunny-fb15-super...

In [4]:
#only read some specific bytes size of data.bt not store as a data frame
chk_size = pd.read_csv('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/data.csv',chunksize=1000)
chk_size

In [4]:
#save data
df.to_csv('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/new_save_data.csv')

In [5]:
#sotre data set separated by other separator
df.to_csv('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/xyz.csv',sep='@')

In [26]:
null_data = pd.read_table('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/null_data.txt')
null_data

   id   name     sal
0   1    NaN  2000.0
1   1  ratna  3000.0
2   1   puja     NaN
3   2   deep   200.0
4   2    NaN  3565.0
5   2   puja     NaN

In [27]:
#replace null with a value but we will not do this things
import sys
null_data.to_csv(sys.stdout,na_rep='null',header=False)

0,1,null,2000.0
1,1,ratna,3000.0
2,1,puja,null
3,2,deep,200.0
4,2,null,3565.0
5,2,puja,null

In [6]:
#data save without index and header
df.to_csv('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/pqr.csv',header=False,index=False)

In [29]:
null_data

   id   name     sal
0   1    NaN  2000.0
1   1  ratna  3000.0
2   1   puja     NaN
3   2   deep   200.0
4   2    NaN  3565.0
5   2   puja     NaN

In [35]:
#with  column name store
null_data.to_csv('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/pqr_new_column.csv',index=False,columns=['name','sal'])

In [2]:
#create date in a range
date_range = pd.date_range('01/01/2000',periods=10)
date_range

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08',
               '2000-01-09', '2000-01-10'],
              dtype='datetime64[ns]', freq='D')

In [3]:
type(date_range)

pandas.core.indexes.datetimes.DatetimeIndex

In [7]:
import numpy as np
ts = pd.Series(np.arange(10),index=date_range)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
2000-01-08    7
2000-01-09    8
2000-01-10    9
Freq: D, dtype: int32

In [11]:
ta = pd.Series(np.arange(3),index=['deep','ratna','rahul'])
ta

deep     0
ratna    1
rahul    2
dtype: int32

In [52]:
ts.to_csv('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/date1.csv')

In [7]:
#other way without using pandas.not recomandate
import csv
f = open('date1.csv')
reader = csv.reader(f)
reader

In [55]:
for i in reader:
    print(i)

['', '0']
['2000-01-01', '0']
['2000-01-02', '1']
['2000-01-03', '2']
['2000-01-04', '3']
['2000-01-05', '4']
['2000-01-06', '5']
['2000-01-07', '6']
['2000-01-08', '7']
['2000-01-09', '8']
['2000-01-10', '9']

In [2]:
df3 = pd.read_table('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/Tabseparated _data.txt')
df3

   id   name   sal
0   1   deep  2000
1   2  ratna  3000
2   3   puja   120

In [41]:
with open('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/zip.txt') as f:
    lines = list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['3', '4', '6'], ['7', '8', '9']]

In [42]:
header , values = lines[0],lines[1:]

In [43]:
header

['a', 'b', 'c']

In [44]:
values

[['1', '2', '3'], ['3', '4', '6'], ['7', '8', '9']]

In [45]:
#zip alaways take iterable object
zip(lines)

In [46]:
list(zip(lines))

[(['a', 'b', 'c'],),
 (['1', '2', '3'],),
 (['3', '4', '6'],),
 (['7', '8', '9'],)]

In [47]:
list(zip(*values))

[('1', '3', '7'), ('2', '4', '8'), ('3', '6', '9')]

In [48]:
list(zip(header,zip(*values)))

[('a', ('1', '3', '7')), ('b', ('2', '4', '8')), ('c', ('3', '6', '9'))]

In [52]:
#for check
c,n = ('a', ('1', '3', '7'))
c

'a'

In [53]:
n

('1', '3', '7')

In [54]:
#in dictonary
data_dict = {h:v for h,v in list(zip(header,zip(*values)))}
data_dict

{'a': ('1', '3', '7'), 'b': ('2', '4', '8'), 'c': ('3', '6', '9')}

# JSON Data

In [8]:
obj = """
{
	"id": "0001",
	"type": "donut",
	"name": "Cake",
	"ppu": 0.55,
	"batters":
		{
			"batter":
				[
					{ "id": "1001", "type": "Regular" },
					{ "id": "1002", "type": "Chocolate" },
					{ "id": "1003", "type": "Blueberry" },
					{ "id": "1004", "type": "Devil's Food" }
				]
		},
	"topping":
		[
			{ "id": "5001", "type": "None" },
			{ "id": "5002", "type": "Glazed" },
			{ "id": "5005", "type": "Sugar" },
			{ "id": "5007", "type": "Powdered Sugar" },
			{ "id": "5006", "type": "Chocolate with Sprinkles" },
			{ "id": "5003", "type": "Chocolate" },
			{ "id": "5004", "type": "Maple" }
		]
}
"""
type(obj)

str

In [47]:
#we can convert only those string to dictonary which strings are compatible of json 
import json;
result = json.loads(obj)
result

{'id': '0001',
 'type': 'donut',
 'name': 'Cake',
 'ppu': 0.55,
 'batters': {'batter': [{'id': '1001', 'type': 'Regular'},
   {'id': '1002', 'type': 'Chocolate'},
   {'id': '1003', 'type': 'Blueberry'},
   {'id': '1004', 'type': "Devil's Food"}]},
 'topping': [{'id': '5001', 'type': 'None'},
  {'id': '5002', 'type': 'Glazed'},
  {'id': '5005', 'type': 'Sugar'},
  {'id': '5007', 'type': 'Powdered Sugar'},
  {'id': '5006', 'type': 'Chocolate with Sprinkles'},
  {'id': '5003', 'type': 'Chocolate'},
  {'id': '5004', 'type': 'Maple'}]}

In [10]:
type(result)

dict

In [11]:
#conver again in str
ajson = json.dumps(result)
type(ajson)

str

In [12]:
#convert json in dataframe
topping = pd.DataFrame(result['topping'],columns=['id','type'])
topping

     id                      type
0  5001                      None
1  5002                    Glazed
2  5005                     Sugar
3  5007            Powdered Sugar
4  5006  Chocolate with Sprinkles
5  5003                 Chocolate
6  5004                     Maple

In [13]:
topping = pd.DataFrame(result['topping'])
topping

     id                      type
0  5001                      None
1  5002                    Glazed
2  5005                     Sugar
3  5007            Powdered Sugar
4  5006  Chocolate with Sprinkles
5  5003                 Chocolate
6  5004                     Maple

In [19]:
jasn = pd.read_json('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/sample3.json')
jasn

   id   type  name   ppu
0   1  donut  Cake  0.55
1   1  donut  Cake  0.55

In [20]:
#store data in json
print(jasn.to_json())

{"id":{"0":1,"1":1},"type":{"0":"donut","1":"donut"},"name":{"0":"Cake","1":"Cake"},"ppu":{"0":0.55,"1":0.55}}

In [21]:
#store in actual json format
print(jasn.to_json(orient='records'))

[{"id":1,"type":"donut","name":"Cake","ppu":0.55},{"id":1,"type":"donut","name":"Cake","ppu":0.55}]

In [24]:
#web Data
web_data = pd.read_html('https://www.basketball-reference.com/leagues/NBA_2015_totals.html')
web_data

[      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
 0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
 1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
 2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
 3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
 4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
 ..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
 670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
 671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
 672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
 673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
 674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

      DRB  TRB  AST  STL BLK  TOV   PF   PTS
 0    222  301   68   27  22   60  147   398
 1     19   28   16   16   7   14   24    94
 2    324  523   66   38  86   99  222   537
 3     54   77   15    4   9    9   30    60
 4    220  247  129   41   7  116  167  1035
 ..   ...  ...  ...  ...  ..  ...  ...   ...
 670  284  411  173  124  25  117  171  1071
 671  170  245  135   86  17   75  115   685
 672  114  166   38   38   8   42   56   386
 673  265  362  100   34  49   62  156   472
 674  319  465  113   18  52   76  205   833

 [675 rows x 30 columns]]

In [25]:
len(web_data)

1

In [26]:
web_data[0]

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

# Binary Data format

In [34]:
#store in binary pickel format
df = pd.read_csv('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/data.csv')
df.to_pickle('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/binary')

In [35]:
pd .read_pickle('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/binary')

,Url Car,Name,Price,Brand,Condition,Img,Img Url
0,https://ikman.lk/en/ad/audi-a4-20tdi-2014-for-...,Audi A4 2.0TDi 2014,72500.0,Audi,Used,Img/0.png,https://i.ikman-st.com/audi-a4-20tdi-2014-for-...
1,https://ikman.lk/en/ad/mercedes-benz-e300-nigh...,Mercedes Benz E300 Night Edition 2015,107500.0,Mercedes Benz,Used,Img/0.png,https://i.ikman-st.com/mercedes-benz-e300-nigh...
2,https://ikman.lk/en/ad/mercedes-benz-c200-head...,Mercedes Benz C200 headup display 2015,109000.0,Mercedes Benz,Used,Img/0.png,https://i.ikman-st.com/mercedes-benz-c200-head...
3,https://ikman.lk/en/ad/toyota-axio-x-grade-200...,Toyota Axio X Grade 2007,31125.0,Toyota,Used,Img/0.png,https://i.ikman-st.com/toyota-axio-x-grade-200...
4,https://ikman.lk/en/ad/micro-panda-12000kms-20...,Micro Panda 12000KMs 2015,12475.0,Micro,Used,Img/0.png,https://i.ikman-st.com/micro-panda-12000kms-20...
...,...,...,...,...,...,...,...
263,https://ikman.lk/en/ad/alfa-romeo-fiat-uno-lks...,Fiat Uno 1984,2750.0,Fiat,Used,Img/0.png,https://i.ikman-st.com/alfa-romeo-fiat-uno-lks...
264,https://ikman.lk/en/ad/toyota-land-cruiser-pra...,Toyota Land Cruiser Prado 2003,59375.0,Toyota,Used,Img/0.png,https://i.ikman-st.com/toyota-land-cruiser-pra...
265,https://ikman.lk/en/ad/mercedes-benz-c180-cabr...,Mercedes Benz C180 Cabriolet 2017,140000.0,Mercedes Benz,Used,Img/0.png,https://i.ikman-st.com/mercedes-benz-c180-cabr...
266,https://ikman.lk/en/ad/bmw-x1-s-drive-diesel-2...,BMW X1 S Drive Diesel 2011,57250.0,BMW,Used,Img/0.png,https://i.ikman-st.com/bmw-x1-s-drive-diesel-2...
267,https://ikman.lk/en/ad/toyota-prius-s-grade-20...,Toyota Prius S Grade 2015,42750.0,Toyota,Used,Img/0.png,https://i.ikman-st.com/toyota-prius-s-grade-20...

In [36]:
import numpy as np;
frame = pd .DataFrame({'a':np.random.rand(100)})
frame

           a
0   0.214359
1   0.448211
2   0.560779
3   0.507205
4   0.789445
..       ...
95  0.315695
96  0.497833
97  0.026337
98  0.281174
99  0.543416

[100 rows x 1 columns]

In [37]:
#store in binary h5 format
storeh5 = pd.HDFStore('storeh5.h5')

In [41]:
storeh5['obj1'] = frame
storeh5['obj1_col'] = frame['a']

In [42]:
storeh5['obj1']

           a
0   0.214359
1   0.448211
2   0.560779
3   0.507205
4   0.789445
..       ...
95  0.315695
96  0.497833
97  0.026337
98  0.281174
99  0.543416

[100 rows x 1 columns]

In [43]:
frame

           a
0   0.214359
1   0.448211
2   0.560779
3   0.507205
4   0.789445
..       ...
95  0.315695
96  0.497833
97  0.026337
98  0.281174
99  0.543416

[100 rows x 1 columns]

# Web API

In [49]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

In [52]:
data = resp.json()
data[1]['user']

{'login': 'meeseeksmachine',
 'id': 39504233,
 'node_id': 'MDQ6VXNlcjM5NTA0MjMz',
 'avatar_url': 'https://avatars.githubusercontent.com/u/39504233?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/meeseeksmachine',
 'html_url': 'https://github.com/meeseeksmachine',
 'followers_url': 'https://api.github.com/users/meeseeksmachine/followers',
 'following_url': 'https://api.github.com/users/meeseeksmachine/following{/other_user}',
 'gists_url': 'https://api.github.com/users/meeseeksmachine/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/meeseeksmachine/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/meeseeksmachine/subscriptions',
 'organizations_url': 'https://api.github.com/users/meeseeksmachine/orgs',
 'repos_url': 'https://api.github.com/users/meeseeksmachine/repos',
 'events_url': 'https://api.github.com/users/meeseeksmachine/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/meeseeksmachine/received_events',
 'type': 'User',
 'site_admin': False}

In [53]:
data[1]['user']['id']

39504233

In [54]:
for i in range(len(data)):
    print(data[i]['user']['id'])

12157034
39504233
8078968
160132
31899203
39696536
39696536
54274219
31857876
91728754
8078968
6618166
37011898
89147478
75975268
26186714
45828280
38472982
24256554
6618166
16756448
14806954
38472982
38295417
6618166
9954897
12542576
33226523
5131271
28805843